return {
  "folke/snacks.nvim",
  opts = {
    picker = {
      hidden = true,
      ignored = true,
    },
    dashboard = {
      preset = {
        pick = function(cmd, opts)
          return LazyVim.pick(cmd, opts)()
        end,
        header = [[
 ██████   ██████    ███████    ██████   █████  █████████  ███████████ █████ ██████████ ███████████
░░██████ ██████   ███░░░░░███ ░░██████ ░░███  ███░░░░░███░█░░░███░░░█░░███ ░░███░░░░░█░█░░░░░░███ 
 ░███░█████░███  ███     ░░███ ░███░███ ░███ ░███    ░░░ ░   ░███  ░  ░███  ░███  █ ░ ░     ███░  
 ░███░░███ ░███ ░███      ░███ ░███░░███░███ ░░█████████     ░███     ░███  ░██████        ███    
 ░███ ░░░  ░███ ░███      ░███ ░███ ░░██████  ░░░░░░░░███    ░███     ░███  ░███░░█       ███     
 ░███      ░███ ░░███     ███  ░███  ░░█████  ███    ░███    ░███     ░███  ░███ ░   █  ████     █
 █████     █████ ░░░███████░   █████  ░░█████░░█████████     █████    █████ ██████████ ███████████
░░░░░     ░░░░░    ░░░░░░░    ░░░░░    ░░░░░  ░░░░░░░░░     ░░░░░    ░░░░░ ░░░░░░░░░░ ░░░░░░░░░░░ 
                                                                                                  
                                                                                                  
                                                                                                  
 ]],
        -- stylua: ignore
        ---@type snacks.dashboard.Item[]
        keys = {
          { icon = "", key = "p", desc = "Projects",      action = ":Telescope projects" },
          { icon = "🔀", key = "o", desc = "Pull Requests",    action = ":Octo pr list" },
          { icon = " ", key = "n", desc = "New File", action = ":ene | startinsert" },
          { icon = " ", key = "c", desc = "Config", action = ":lua Snacks.dashboard.pick('files', {cwd = vim.fn.stdpath('config')})" },
          { icon = " ", key = "q", desc = "Quit", action = ":qa" },
        },
      },
    },
  },
}
